#7
print(40 > 50 and 11 < 13)
print(350 == 350 and 430 == 430)
print(10 > 20 and 10 < 11)
print(10 < 20 and 15 > 2)
print(10 == 10 and 20 == 2)
print(60 ==60 and 35 == 35)
print(30 > 50 and 21 < 22)
print(40 > 50 and 11 < 13)
print(350 == 350 and 430 == 430)
print(10 > 20 and 10 < 11)

print(10 <= 11)
print(14 == 20)
print(10 != 11)
print(18 >= 10)
print(20 == 20)
print(10 < 20)
print(19 > 20)
print(10 <= 20)
print(36 >= 20)
print(10 <= 15)

#1
num1 = 5.23
num2 = 4.23
print(num1 + num2)

#3
age = int(input(" what is your age:" ))
print(age + 10)


#2
name =("nutsa")
lastname=("macharashvili")
print(name+lastname)

#4
num1=int(input("enter the num: "))
num2=int(input("enter the num: "))
print(num1+num2)


#8
კომპიუტერულ მეცნიერებაში ფსევდოკოდი არის ალგორითმის საფეხურების აღწერა, პროგრამირების ენების კონვენციების ნაზავის გამოყენებით (როგორიცაა დავალების ოპერატორი, პირობითი ოპერატორი, მარყუჟი) ქმედებებისა და პირობების არაფორმალური, როგორც წესი, თვითგანმარტებითი აღნიშვნით


#9
#პროგრამირებაში არის შემთხვევები, როდესაც გადაწყვეტილების მიღებაა საჭირო. შერჩევა არის გადაწყვეტილების მიღების პროცესი. გადაწყვეტილების შედეგი განსაზღვრავს, თუ რომელი გზა ხურავს პროგრამას კომპიუტერისთვის ინსტრუქციების თანმიმდევრობა. მიიღებს შემდეგს.
﻿

